// dz Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
// и проверяет, является ли этот день выходным.
// Console.Write("Введите цифру : ");
// int number = Convert.ToInt32(Console.ReadLine());
// if (number<8 && number>0)
// {
//     if (number<6 && number>0)   
//     {

//     Console.Write("нет");
//     }
//  else
//     {
//         Console.Write("да");
//     }

// }